БухЭксп/Catalogs/CW_ТипыТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ТипыТранспортныхСредств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеКузоваИлиЦистерны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеРефрижираторнойУстановки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ТипыТранспортныхСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьЗначенияПреопределенныхЭлементов() Экспорт
	
	МакетСтандартнаяНастройка = ПолучитьМакет("СтандартнаяНастройка");
	
	//Имя	Наименование	Вид ТС	НаличиеКузова	НаличиеРефрижиратора
	// 1	3				4		5				6
	
	Для Стр = 2 по МакетСтандартнаяНастройка.ВысотаТаблицы Цикл
		
		ИмяЭлемента				= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C1").Текст);
		НаименованиеЭлемента	= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C3").Текст);
		ВидТС					= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C4").Текст);
		НаличиеКузова			= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C5").Текст);
		НаличиеРефрижиратора	= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C6").Текст);
		
		Попытка
			СпрОбъект 									= Справочники.CW_ТипыТранспортныхСредств[ИмяЭлемента].ПолучитьОбъект();
			СпрОбъект.Наименование 						= НаименованиеЭлемента;
			СпрОбъект.ВидТС 							= Перечисления.CW_ВидыТС[ВидТС];
			СпрОбъект.НаличиеКузоваИлиЦистерны 			= Вычислить(НаличиеКузова);
			СпрОбъект.НаличиеРефрижираторнойУстановки 	= Вычислить(НаличиеРефрижиратора);
				
			СпрОбъект.Записать();
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
